src/src/AccumulationRegisters/Inventory.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<AccumulationRegister>
		<Properties>
			<Name>Inventory</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Quantity</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Amount</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>StructuralUnitCorr</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.BusinessUnits</v8:Type>
						<v8:Type>cfg:CatalogRef.Counterparties</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CorrGLAccount</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.PrimaryChartOfAccounts</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ProductsCorr</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Products</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CharacteristicCorr</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ProductsCharacteristics</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>BatchCorr</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ProductsBatches</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CustomerCorrOrder</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.SalesOrder</v8:Type>
						<v8:Type>cfg:DocumentRef.WorkOrder</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Specification</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.BillsOfMaterials</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SpecificationCorr</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.BillsOfMaterials</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CorrSalesOrder</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.SalesOrder</v8:Type>
						<v8:Type>cfg:DocumentRef.WorkOrder</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SourceDocument</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.InventoryWriteOff</v8:Type>
						<v8:Type>cfg:DocumentRef.SalesInvoice</v8:Type>
						<v8:Type>cfg:DocumentRef.AccountSalesFromConsignee</v8:Type>
						<v8:Type>cfg:DocumentRef.InventoryTransfer</v8:Type>
						<v8:Type>cfg:DocumentRef.SupplierInvoice</v8:Type>
						<v8:Type>cfg:DocumentRef.SubcontractorReportIssued</v8:Type>
						<v8:Type>cfg:DocumentRef.SalesOrder</v8:Type>
						<v8:Type>cfg:DocumentRef.GoodsReceipt</v8:Type>
						<v8:Type>cfg:DocumentRef.ShiftClosure</v8:Type>
						<v8:Type>cfg:DocumentRef.WorkOrder</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Department</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.BusinessUnits</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Responsible</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Employees</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VATRate</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.VATRates</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FixedCost</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ProductionExpenses</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Return</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ContentOfAccountingRecord</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RetailTransferEarningAccounting</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>OfflineRecord</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SalesRep</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Employees</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>StructuralUnit</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.BusinessUnits</v8:Type>
						<v8:Type>cfg:CatalogRef.Counterparties</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>GLAccount</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.PrimaryChartOfAccounts</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Products</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Products</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Characteristic</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ProductsCharacteristics</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Batch</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ProductsBatches</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>SalesOrder</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.SalesOrder</v8:Type>
						<v8:Type>cfg:DocumentRef.WorkOrder</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/src/Enums/VATTaxationTypes.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>VATTaxationTypes</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>SubjectToVAT</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ReverseChargeVAT</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ForExport</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>NotSubjectToVAT</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/src/Enums/OperationTypesGoodsReturn.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>OperationTypesGoodsReturn</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>FromCustomer</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ToSupplier</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/src/Documents/InventoryWriteOff.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Document>
		<Properties>
			<Name>InventoryWriteOff</Name>
			<BasedOn>
				<xr:Item>Document.Stocktaking</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.LandedCosts</xr:Item>
				<xr:Item>AccumulationRegister.InventoryCostLayer</xr:Item>
				<xr:Item>AccumulationRegister.InventoryInWarehouses</xr:Item>
				<xr:Item>AccumulationRegister.SerialNumbers</xr:Item>
				<xr:Item>AccountingRegister.AccountingJournalEntries</xr:Item>
				<xr:Item>AccumulationRegister.Inventory</xr:Item>
				<xr:Item>InformationRegister.SerialNumbersInWarranty</xr:Item>
				<xr:Item>AccumulationRegister.IncomeAndExpenses</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>StructuralUnit</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.BusinessUnits</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Cell</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Cells</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>BasisDocument</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Stocktaking</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Correspondence</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.PrimaryChartOfAccounts</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RetireInventoryFromOperation</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Comment</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Author</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Inventory</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Products</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Products</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Characteristic</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ProductsCharacteristics</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Batch</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ProductsBatches</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Quantity</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>MeasurementUnit</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.UOMClassifier</v8:Type>
								<v8:Type>cfg:CatalogRef.UOM</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>SerialNumbers</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ConnectionKey</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>InventoryGLAccount</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.PrimaryChartOfAccounts</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>SerialNumbers</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>SerialNumber</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.SerialNumbers</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ConnectionKey</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/src/AccumulationRegisters/Inventory/Ext/ManagerModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region ProgramInterface

// Procedure creates an empty temporary table of records change.
//
Procedure CreateEmptyTemporaryTableChange(AdditionalProperties) Export
	
	If Not AdditionalProperties.Property("ForPosting")
	 OR Not AdditionalProperties.ForPosting.Property("StructureTemporaryTables") Then
		Return;
	EndIf;
	
	StructureTemporaryTables = AdditionalProperties.ForPosting.StructureTemporaryTables;
	
	Query = New Query(
	"SELECT TOP 0
	|	Inventory.LineNumber AS LineNumber,
	|	Inventory.Company AS Company,
	|	Inventory.StructuralUnit AS StructuralUnit,
	|	Inventory.GLAccount AS GLAccount,
	|	Inventory.Products AS Products,
	|	Inventory.Characteristic AS Characteristic,
	|	Inventory.Batch AS Batch,
	|	Inventory.SalesOrder AS SalesOrder,
	|	Inventory.Quantity AS QuantityBeforeWrite,
	|	Inventory.Quantity AS QuantityChange,
	|	Inventory.Quantity AS QuantityOnWrite,
	|	Inventory.Amount AS SumBeforeWrite,
	|	Inventory.Amount AS AmountChange,
	|	Inventory.Amount AS AmountOnWrite
	|INTO RegisterRecordsInventoryChange
	|FROM
	|	AccumulationRegister.Inventory AS Inventory");
	
	Query.TempTablesManager = StructureTemporaryTables.TempTablesManager;
	QueryResult = Query.Execute();
	
	StructureTemporaryTables.Insert("RegisterRecordsInventoryChange", False);
	
EndProcedure

#EndRegion

#Region InfobaseUpdate

Procedure ProcessDataToUpgradeToNewVersion() Export
	
	Query = New Query;
	Query.TempTablesManager = New TempTablesManager;
	Query.Text = 
	"SELECT
	|	DebitNote.Ref AS Ref
	|INTO DebitNotes
	|FROM
	|	Document.DebitNote AS DebitNote
	|		LEFT JOIN Constant.FunctionalOptionUseVAT AS FunctionalOptionUseVAT
	|		ON (TRUE)
	|WHERE
	|	DebitNote.Posted
	|	AND DebitNote.AmountIncludesVAT
	|	AND DebitNote.VATTaxation <> VALUE(Enum.VATTaxationTypes.NotSubjectToVAT)
	|	AND FunctionalOptionUseVAT.Value
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	DebitNotes.Ref AS Ref,
	|	DebitNoteInventory.Batch AS Batch,
	|	DebitNoteInventory.Characteristic AS Characteristic,
	|	DebitNoteInventory.Products AS Products,
	|	SUM(DebitNoteInventory.Amount) AS Amount,
	|	SUM(DebitNoteInventory.VATAmount) AS VATAmount,
	|	DebitNoteInventory.VATRate AS VATRate
	|INTO DebitNoteInventory
	|FROM
	|	DebitNotes AS DebitNotes
	|		LEFT JOIN Document.DebitNote.Inventory AS DebitNoteInventory
	|		ON DebitNotes.Ref = DebitNoteInventory.Ref
	|WHERE
	|	DebitNoteInventory.VATAmount <> 0
	|
	|GROUP BY
	|	DebitNotes.Ref,
	|	DebitNoteInventory.Batch,
	|	DebitNoteInventory.Characteristic,
	|	DebitNoteInventory.Products,
	|	DebitNoteInventory.VATRate
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	Inventory.Recorder AS Ref
	|FROM
	|	DebitNoteInventory AS DebitNoteInventory
	|		INNER JOIN AccumulationRegister.Inventory AS Inventory
	|		ON DebitNoteInventory.Ref = Inventory.Recorder
	|			AND DebitNoteInventory.Products = Inventory.Products
	|			AND DebitNoteInventory.Characteristic = Inventory.Characteristic
	|			AND DebitNoteInventory.Batch = Inventory.Batch
	|			AND DebitNoteInventory.VATRate = Inventory.VATRate
	|			AND DebitNoteInventory.Amount = Inventory.Amount";
	
	QueryResult = Query.Execute();
	Selection	= QueryResult.Select();
	
	While Selection.Next() Do
		Query.Text = 
		"SELECT
		|	Inventory.Period AS Period,
		|	Inventory.Recorder AS Recorder,
		|	Inventory.RecordType AS RecordType,
		|	Inventory.Company AS Company,
		|	Inventory.StructuralUnit AS StructuralUnit,
		|	Inventory.GLAccount AS GLAccount,
		|	Inventory.Products AS Products,
		|	Inventory.Characteristic AS Characteristic,
		|	Inventory.Batch AS Batch,
		|	Inventory.Quantity AS Quantity,
		|	Inventory.VATRate AS VATRate,
		|	Inventory.Responsible AS Responsible,
		|	Inventory.Department AS Department,
		|	Inventory.ContentOfAccountingRecord AS ContentOfAccountingRecord,
		|	Inventory.Amount AS Amount
		|INTO Inventory
		|FROM
		|	AccumulationRegister.Inventory AS Inventory
		|WHERE
		|	Inventory.Recorder = &Ref
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|SELECT
		|	Inventory.Period AS Period,
		|	Inventory.Recorder AS Recorder,
		|	Inventory.RecordType AS RecordType,
		|	Inventory.Company AS Company,
		|	Inventory.StructuralUnit AS StructuralUnit,
		|	Inventory.GLAccount AS GLAccount,
		|	Inventory.Products AS Products,
		|	Inventory.Characteristic AS Characteristic,
		|	Inventory.Batch AS Batch,
		|	Inventory.Quantity AS Quantity,
		|	Inventory.Amount - DebitNoteInventory.VATAmount AS Amount,
		|	Inventory.VATRate AS VATRate,
		|	Inventory.Responsible AS Responsible,
		|	Inventory.Department AS Department,
		|	Inventory.ContentOfAccountingRecord AS ContentOfAccountingRecord
		|FROM
		|	Inventory AS Inventory
		|		INNER JOIN DebitNoteInventory AS DebitNoteInventory
		|		ON Inventory.Recorder = DebitNoteInventory.Ref
		|			AND Inventory.Products = DebitNoteInventory.Products
		|			AND Inventory.Characteristic = DebitNoteInventory.Characteristic
		|			AND Inventory.Batch = DebitNoteInventory.Batch
		|			AND Inventory.VATRate = DebitNoteInventory.VATRate";
		
		Query.SetParameter("Ref", Selection.Ref);
		
		RegisterRecords = AccumulationRegisters.Inventory.CreateRecordSet();
		RegisterRecords.Filter.Recorder.Set(Selection.Ref);
		RegisterRecords.Load(Query.Execute().Unload());
		RegisterRecords.Write();
	EndDo;
	
EndProcedure

// Fill the SalesDocument and CorrGLAccount in register records.
//
Procedure FillCorrAttributes() Export
	
	Query = New Query(
	"SELECT
	|	Table.Recorder AS Ref
	|FROM
	|	AccumulationRegister.Inventory AS Table
	|		INNER JOIN Document.GoodsReturn AS GoodsReturn
	|		ON Table.Recorder = GoodsReturn.Ref
	|WHERE
	|	Table.SourceDocument = UNDEFINED
	|	AND GoodsReturn.OperationKind = VALUE(Enum.OperationTypesGoodsReturn.ToSupplier)
	|
	|UNION ALL
	|
	|SELECT
	|	Table.Recorder
	|FROM
	|	AccumulationRegister.Inventory AS Table
	|WHERE
	|	Table.SourceDocument = UNDEFINED
	|	AND VALUETYPE(Table.Recorder) = VALUE(Document.DebitNote)
	|
	|UNION ALL
	|
	|SELECT
	|	Records.Recorder
	|FROM
	|	AccumulationRegister.Inventory AS Records
	|		INNER JOIN Document.InventoryWriteOff AS InventoryWriteOff
	|		ON Records.Recorder = InventoryWriteOff.Ref
	|WHERE
	|	InventoryWriteOff.Correspondence <> VALUE(ChartOfAccounts.PrimaryChartOfAccounts.EmptyRef)
	|	AND Records.CorrGLAccount = VALUE(ChartOfAccounts.PrimaryChartOfAccounts.EmptyRef)
	|
	|UNION ALL
	|
	|SELECT
	|	Records.Recorder
	|FROM
	|	AccumulationRegister.Inventory AS Records
	|		INNER JOIN Document.InventoryTransfer AS InventoryTransfer
	|		ON Records.Recorder = InventoryTransfer.Ref
	|WHERE
	|	Records.StructuralUnitCorr = VALUE(Catalog.BusinessUnits.EmptyRef)");
	
	Selection = Query.Execute().Select();
	While Selection.Next() Do
		
		BeginTransaction();
		
		DocObject = Selection.Ref.GetObject();
		
		DriveServer.InitializeAdditionalPropertiesForPosting(DocObject.Ref, DocObject.AdditionalProperties);
		
		Documents[DocObject.Metadata().Name].InitializeDocumentData(DocObject.Ref, DocObject.AdditionalProperties);
		
		If DocObject.AdditionalProperties.TableForRegisterRecords.Property("TableInventory")
			And DocObject.AdditionalProperties.TableForRegisterRecords.TableInventory.Count() Then
			DriveServer.ReflectInventory(DocObject.AdditionalProperties, DocObject.RegisterRecords, False);
		EndIf;
		
		DriveServer.WriteRecordSets(DocObject.ThisObject);
		
		DocObject.AdditionalProperties.ForPosting.StructureTemporaryTables.TempTablesManager.Close();
		
		CommitTransaction();
		
	EndDo;
	
EndProcedure

// Replacing Sales order empty ref to UNDEFINED
Procedure ChangeSalesOrderEmptyRefToUndefined() Export
	
	Query = New Query;
	Query.TempTablesManager = New TempTablesManager;
	Query.Text = 
	"SELECT
	|	Inventory.Recorder AS Ref
	|FROM
	|	AccumulationRegister.Inventory AS Inventory
	|WHERE
	|	(Inventory.SalesOrder = VALUE(Document.SalesOrder.EmptyRef)
	|			OR Inventory.CorrSalesOrder = VALUE(Document.SalesOrder.EmptyRef))";
	
	QueryResult = Query.Execute();
	Selection	= QueryResult.Select();
	
	While Selection.Next() Do
		Query.Text = 
		"SELECT
		|	Inventory.Period AS Period,
		|	Inventory.Recorder AS Recorder,
		|	Inventory.LineNumber AS LineNumber,
		|	Inventory.Active AS Active,
		|	Inventory.RecordType AS RecordType,
		|	Inventory.Company AS Company,
		|	Inventory.StructuralUnit AS StructuralUnit,
		|	Inventory.GLAccount AS GLAccount,
		|	Inventory.Products AS Products,
		|	Inventory.Characteristic AS Characteristic,
		|	Inventory.Batch AS Batch,
		|	CASE
		|		WHEN Inventory.SalesOrder = VALUE(Document.SalesOrder.EmptyRef)
		|			THEN UNDEFINED
		|		ELSE Inventory.SalesOrder
		|	END AS SalesOrder,
		|	Inventory.Quantity AS Quantity,
		|	Inventory.Amount AS Amount,
		|	Inventory.StructuralUnitCorr AS StructuralUnitCorr,
		|	Inventory.CorrGLAccount AS CorrGLAccount,
		|	Inventory.ProductsCorr AS ProductsCorr,
		|	Inventory.CharacteristicCorr AS CharacteristicCorr,
		|	Inventory.BatchCorr AS BatchCorr,
		|	Inventory.CustomerCorrOrder AS CustomerCorrOrder,
		|	Inventory.Specification AS Specification,
		|	Inventory.SpecificationCorr AS SpecificationCorr,
		|	CASE
		|		WHEN Inventory.CorrSalesOrder = VALUE(Document.SalesOrder.EmptyRef)
		|			THEN UNDEFINED
		|		ELSE Inventory.CorrSalesOrder
		|	END AS CorrSalesOrder,
		|	Inventory.SourceDocument AS SourceDocument,
		|	Inventory.Department AS Department,
		|	Inventory.Responsible AS Responsible,
		|	Inventory.VATRate AS VATRate,
		|	Inventory.FixedCost AS FixedCost,
		|	Inventory.ProductionExpenses AS ProductionExpenses,
		|	Inventory.Return AS Return,
		|	Inventory.ContentOfAccountingRecord AS ContentOfAccountingRecord,
		|	Inventory.RetailTransferEarningAccounting AS RetailTransferEarningAccounting,
		|	Inventory.OfflineRecord AS OfflineRecord
		|FROM
		|	AccumulationRegister.Inventory AS Inventory
		|WHERE
		|	Inventory.Recorder = &Ref";
		
		Query.SetParameter("Ref", Selection.Ref);
		
		RegisterRecords = AccumulationRegisters.Inventory.CreateRecordSet();
		RegisterRecords.Filter.Recorder.Set(Selection.Ref);
		RegisterRecords.Load(Query.Execute().Unload());
		
		Try
			RegisterRecords.Write();
		Except
			ErrorDescription = StringFunctionsClientServer.SubstituteParametersInString(
				NStr("en = 'Error on write document %1: %2'"),
				Selection.Ref,
				BriefErrorDescription(ErrorInfo()));
				
			WriteLogEvent(
				NStr("en = 'InfobaseUpdate'", CommonUseClientServer.MainLanguageCode()),
				EventLogLevel.Error,
				Metadata.AccumulationRegisters.Inventory,
				,
				ErrorDescription);
		EndTry;
			
	EndDo;
	
EndProcedure

#EndRegion

#EndIf
